extension/src/InformationRegisters/мкпСостоянияЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>мкпСостоянияЗаданий</Name>
			<Comment>Статус и результат фоновых операций query/report.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>36</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Статус</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>20</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>20</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатJSON</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>0</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаJSON</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>0</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.мкпКлиентыИнтеграции</v8:Type>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Момент</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>DateTime</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

extension/src/CommonModules/мкпЗадания/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция Поставить(Операция, ТелоJSON) Экспорт

	Если Операция = "action" Тогда
		Возврат Новый Структура("КодСостояния,КодОшибки,Подробность",
			501, "not_implemented", "Вызов действий — фаза 3.");
	КонецЕсли;
	Если Операция = "query" Тогда
		Исполнение = мкпЗапросы.ВыполнитьПоТелу(ТелоJSON);
	ИначеЕсли Операция = "report" Тогда
		Исполнение = мкпОтчёты.ВыполнитьПоТелу(ТелоJSON);
	Иначе
		Возврат Новый Структура("КодСостояния,КодОшибки,Подробность",
			400, "bad_request", "operation: query или report");
	КонецЕсли;
	Если Исполнение.Свойство("КодОшибки") Тогда
		Возврат Исполнение;
	КонецЕсли;
	Ид = Строка(Новый УникальныйИдентификатор);
	Записать(Ид, Операция, "succeeded", мкпСериализация.ВJSON(Исполнение.Тело), "");
	Принято = Новый Структура("job_id,status", Ид, "queued");
	Возврат Новый Структура("КодСостояния,Тело", 202, Принято);

КонецФункции

Функция Получить(Ид) Экспорт

	Менеджер = РегистрыСведений.мкпСостоянияЗаданий.СоздатьМенеджерЗаписи();
	Менеджер.Идентификатор = Строка(Ид);
	Менеджер.Прочитать();
	Если Не Менеджер.Выбран() Тогда
		Возврат Новый Структура("КодСостояния,КодОшибки,Подробность",
			404, "not_found", "Задание не найдено");
	КонецЕсли;
	Тело = Новый Структура("job_id,status", Менеджер.Идентификатор, Менеджер.Статус);
	Если Не ПустаяСтрока(Менеджер.РезультатJSON) Тогда
		Тело.Вставить("result", мкпСериализация.ИзJSON(Менеджер.РезультатJSON));
	КонецЕсли;
	Если Не ПустаяСтрока(Менеджер.ОшибкаJSON) Тогда
		Тело.Вставить("error", мкпСериализация.ИзJSON(Менеджер.ОшибкаJSON));
	КонецЕсли;
	Возврат Новый Структура("КодСостояния,Тело", 200, Тело);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Записать(Ид, Операция, Статус, РезультатJSON, ОшибкаJSON)

	Менеджер = РегистрыСведений.мкпСостоянияЗаданий.СоздатьМенеджерЗаписи();
	Менеджер.Идентификатор = Ид;
	Менеджер.Операция = Операция;
	Менеджер.Статус = Статус;
	Менеджер.РезультатJSON = РезультатJSON;
	Менеджер.ОшибкаJSON = ОшибкаJSON;
	Менеджер.Момент = ТекущаяДатаСеанса();
	Менеджер.Записать();

КонецПроцедуры

#КонецОбласти
